In [1]:
import pandas as pd
import  plotly
import json
import requests
import numpy as np

# Getting 2021 happiness report dataset
and importing its useful data to our fakePerson dataset

In [2]:
df=pd.read_csv("randomUsers.csv")

In [3]:
happ= pd.read_csv("happines21.csv")
happ.head()

,Country name,Regional indicator,Ladder score,Standard error of ladder score,upperwhisker,lowerwhisker,Logged GDP per capita,Social support,Healthy life expectancy,Freedom to make life choices,Generosity,Perceptions of corruption,Ladder score in Dystopia,Explained by: Log GDP per capita,Explained by: Social support,Explained by: Healthy life expectancy,Explained by: Freedom to make life choices,Explained by: Generosity,Explained by: Perceptions of corruption,Dystopia + residual
0,Finland,Western Europe,7.842,0.032,7.904,7.780,10.775,0.954,72.0,0.949,-0.098,0.186,2.43,1.446,1.106,0.741,0.691,0.124,0.481,3.253
1,Denmark,Western Europe,7.620,0.035,7.687,7.552,10.933,0.954,72.7,0.946,0.030,0.179,2.43,1.502,1.108,0.763,0.686,0.208,0.485,2.868
2,Switzerland,Western Europe,7.571,0.036,7.643,7.500,11.117,0.942,74.4,0.919,0.025,0.292,2.43,1.566,1.079,0.816,0.653,0.204,0.413,2.839
3,Iceland,Western Europe,7.554,0.059,7.670,7.438,10.878,0.983,73.0,0.955,0.160,0.673,2.43,1.482,1.172,0.772,0.698,0.293,0.170,2.967
4,Netherlands,Western Europe,7.464,0.027,7.518,7.410,10.932,0.942,72.4,0.913,0.175,0.338,2.43,1.501,1.079,0.753,0.647,0.302,0.384,2.798

In [4]:
cols = happ.columns
# cols[[0,2]]
hdf= happ[cols[[0,2]]]
hdf

    Country name  Ladder score
0        Finland         7.842
1        Denmark         7.620
2    Switzerland         7.571
3        Iceland         7.554
4    Netherlands         7.464
..           ...           ...
144      Lesotho         3.512
145     Botswana         3.467
146       Rwanda         3.415
147     Zimbabwe         3.145
148  Afghanistan         2.523

[149 rows x 2 columns]

In [5]:
df["location.country"].unique()

array(['Denmark', 'Ukraine', 'Iran', 'Australia', 'Ireland',
       'United States', 'Canada', 'United Kingdom', 'France',
       'Netherlands', 'Spain', 'Norway', 'Switzerland', 'Brazil',
       'Serbia', 'New Zealand', 'Germany', 'Turkey', 'Finland', 'Mexico',
       'India'], dtype=object)

In [6]:
def findinSeries(elem, series):
    # print(elem)
    for i,x in enumerate(series):
        if x== elem:
            # print("i",i, x)
            return i
    return -1

In [11]:
copydf= df
# copydf["happiness"] = np.where(copydf["location.country"] in hdf[cols[0]].tolist(),"wa3 bla3","")
copydf["happiness"] = copydf["location.country"].apply(lambda x: hdf['Ladder score'][findinSeries(x,hdf['Country name'].tolist())] if x in hdf[cols[0]].tolist() else "")
copydf[["happiness","location.country"]]

       happiness location.country
0          7.620          Denmark
1          4.875          Ukraine
2          4.721             Iran
3          7.183        Australia
4          4.875          Ukraine
...          ...              ...
16995      7.571      Switzerland
16996      7.620          Denmark
16997      6.317           Mexico
16998      7.392           Norway
16999      4.721             Iran

[17000 rows x 2 columns]

In [12]:
copydf.head()

,gender,name.title,name.first,name.last,location.street.number,location.street.name,location.city,location.state,location.country,location.postcode,location.coordinates.latitude,location.coordinates.longitude,location.timezone.offset,location.timezone.description,dob.date,dob.age,happiness
0,male,Mr,Storm,Madsen,6771,Svinget,Randers Nø,Hovedstaden,Denmark,87306,-46.1343,-86.6480,-3:30,Newfoundland,1986-03-17T15:41:16.272Z,36,7.620
1,male,Mr,Gordoslav,Bosik,3517,Pogulyanka,Ternopil,Ivano-Frankivska,Ukraine,83512,78.7516,-108.7593,-9:00,Alaska,1963-07-05T17:37:05.470Z,59,4.875
2,female,Mrs,آرمیتا,محمدخان,3010,امام خمینی,دزفول,خراسان رضوی,Iran,46674,19.8684,175.9099,+6:00,"Almaty, Dhaka, Colombo",1986-07-21T20:06:46.754Z,36,4.721
3,male,Mr,Daryl,Chambers,7096,Spring Hill Rd,Busselton,New South Wales,Australia,5724,-87.1313,-77.0928,-9:00,Alaska,1972-04-18T18:38:04.636Z,50,7.183
4,male,Mr,Bilogost,Drizhenko,7323,Kerchenska ploshcha,Kam'yanske,Odeska,Ukraine,13704,78.2755,-78.9680,-2:00,Mid-Atlantic,1950-12-08T08:21:03.631Z,71,4.875

In [13]:
copydf["happiness"] = copydf["happiness"]+(np.random.randint(-20,21,copydf.shape[0]).astype("float")/10)
copydf[copydf.columns[[2,-1]]]

      name.first  happiness
0          Storm      6.920
1      Gordoslav      3.975
2         آرمیتا      6.021
3          Daryl      5.383
4       Bilogost      3.875
...          ...        ...
16995    Eduardo      7.371
16996     Olivia      8.020
16997     Estela      5.917
16998       Ivan      5.392
16999       مانی      3.621

[17000 rows x 2 columns]

# Filling the rest of the columns Case by Case

In [14]:
# questionnaire = pd.read_csv("questionnaire.csv")
# # questionnaire.columns= pd.Series(questionnaire.columns).apply(lambda x: x.replace(" ","_"))
# # questionnaire = questionnaire.drop(['Unnamed: 0'],axis=1)
# # questionnaire= questionnaire.rename(columns={'Name_initials':'Name'})
# questionnaire.to_csv("questionnaire.csv")
# len(questionnaire.columns.tolist())co

In [142]:
questDF= pd.DataFrame()
questDF

Empty DataFrame
Columns: []
Index: []

In [143]:
def fillState(dataframe,index,name,min=1,max=11):
    dataframe[name]= np.random.choice(list(range(min,max)), dataframe.shape[0])
    return dataframe

## Personal Info
### Name

In [144]:
questDF["Name"]= copydf['name.first']+" "+ copydf['name.last']
questDF

                     Name
0            Storm Madsen
1         Gordoslav Bosik
2          آرمیتا محمدخان
3          Daryl Chambers
4      Bilogost Drizhenko
...                   ...
16995       Eduardo Colin
16996   Olivia Kristensen
16997         Estela Rojo
16998      Ivan Hillestad
16999          مانی حسینی

[17000 rows x 1 columns]

### Gender

In [145]:
questDF["Gender"]= copydf['gender']
questDF

                     Name  Gender
0            Storm Madsen    male
1         Gordoslav Bosik    male
2          آرمیتا محمدخان  female
3          Daryl Chambers    male
4      Bilogost Drizhenko    male
...                   ...     ...
16995       Eduardo Colin    male
16996   Olivia Kristensen  female
16997         Estela Rojo  female
16998      Ivan Hillestad    male
16999          مانی حسینی    male

[17000 rows x 2 columns]

### Age

In [146]:
questDF["Age"]= copydf['dob.age']
questDF

                     Name  Gender  Age
0            Storm Madsen    male   36
1         Gordoslav Bosik    male   59
2          آرمیتا محمدخان  female   36
3          Daryl Chambers    male   50
4      Bilogost Drizhenko    male   71
...                   ...     ...  ...
16995       Eduardo Colin    male   73
16996   Olivia Kristensen  female   27
16997         Estela Rojo  female   67
16998      Ivan Hillestad    male   67
16999          مانی حسینی    male   67

[17000 rows x 3 columns]

### Ethnicity

In [147]:
ethnicities = ["Hispanic", "White", "White", "White", "Black", "Black", "Black", "White", "White", "Asian", "Asian", "Arab", "Arab", "Arab"]
questDF["Ethnicity"]= np.random.choice(ethnicities, questDF.shape[0])
questDF

                     Name  Gender  Age Ethnicity
0            Storm Madsen    male   36     White
1         Gordoslav Bosik    male   59     White
2          آرمیتا محمدخان  female   36      Arab
3          Daryl Chambers    male   50      Arab
4      Bilogost Drizhenko    male   71      Arab
...                   ...     ...  ...       ...
16995       Eduardo Colin    male   73  Hispanic
16996   Olivia Kristensen  female   27      Arab
16997         Estela Rojo  female   67  Hispanic
16998      Ivan Hillestad    male   67      Arab
16999          مانی حسینی    male   67     Black

[17000 rows x 4 columns]

## Family
### Family Status

In [148]:
statuses = ['Abandonned', 'Adopted', 'Adopted',
            'biological family', 'biological family', 'biological family', 'biological family',
            'step family', 'step family', 'extended family', 'extended family', 'extended family']
questDF["Family_Status"]= np.random.choice(statuses, questDF.shape[0])
questDF

                     Name  Gender  Age Ethnicity      Family_Status
0            Storm Madsen    male   36     White        step family
1         Gordoslav Bosik    male   59     White         Abandonned
2          آرمیتا محمدخان  female   36      Arab         Abandonned
3          Daryl Chambers    male   50      Arab    extended family
4      Bilogost Drizhenko    male   71      Arab        step family
...                   ...     ...  ...       ...                ...
16995       Eduardo Colin    male   73  Hispanic    extended family
16996   Olivia Kristensen  female   27      Arab    extended family
16997         Estela Rojo  female   67  Hispanic  biological family
16998      Ivan Hillestad    male   67      Arab    extended family
16999          مانی حسینی    male   67     Black         Abandonned

[17000 rows x 5 columns]

### Number Of Caretakers

In [149]:
nCaretakers= [0]+[1]*3+[2]*5+[3]*3+[4]*2+[5]
questDF["Number_Caretakers"]= np.random.choice(nCaretakers, questDF.shape[0])
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers
0,Storm Madsen,male,36,White,step family,3
1,Gordoslav Bosik,male,59,White,Abandonned,2
2,آرمیتا محمدخان,female,36,Arab,Abandonned,0
3,Daryl Chambers,male,50,Arab,extended family,5
4,Bilogost Drizhenko,male,71,Arab,step family,2
...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Hispanic,extended family,2
16996,Olivia Kristensen,female,27,Arab,extended family,2
16997,Estela Rojo,female,67,Hispanic,biological family,2
16998,Ivan Hillestad,male,67,Arab,extended family,2
16999,مانی حسینی,male,67,Black,Abandonned,0

### State of Caretakers
the more caretakers you have the less likely it is to have a low state of caretakers

In [150]:
sCaretakers=[[0],                                            #0 caretakers
             [0,1]*4+[1,2,3]*2+[4,6,5]*4+[7,8,9]*2+[10],     #1 Caretaker
             [0,1]*2+[1,2,3,4]*2+[4,6,5]*4+[7,8,9]*3+[10]*2, #2 Caretakers
             [0,1]*1+[1,2,3]*2+[4,6,5]*5+[7,8,9]*4+[10]*2,   #3 Caretakers
             [0,1]*1+[1,2,3]*3+[4,6,5]*5+[7,8,9]*3+[10]*3,   #4 Caretakers
             [0,1]*3+[1,2,3]*2+[4,6,5]*5+[7,8,9]*4+[10]*4    #5 Caretakers
            ]
pname="Number_Caretakers"
questDF["State_Caretakers"] = np.where(questDF[pname]== 0,np.random.choice(sCaretakers[0],questDF.shape[0]),
                                       np.where(questDF[pname]== 1,np.random.choice(sCaretakers[1],questDF.shape[0]),
                                                np.where(questDF[pname]== 2, np.random.choice(sCaretakers[2], questDF.shape[0]),
                                                         np.where(questDF[pname]== 3, np.random.choice(sCaretakers[3], questDF.shape[0]),
                                                                  np.where(questDF[pname]== 4, np.random.choice(sCaretakers[4], questDF.shape[0]),
                                                                           np.where(questDF[pname]== 5, np.random.choice(sCaretakers[5], questDF.shape[0]),"")
                                                                           )
                                                                  )
                                                         )
                                                )
                                       )
questDF[questDF.columns[[-3,-2,-1]]]

           Family_Status  Number_Caretakers State_Caretakers
0            step family                  3                1
1             Abandonned                  2                4
2             Abandonned                  0                0
3        extended family                  5               10
4            step family                  2                2
...                  ...                ...              ...
16995    extended family                  2                4
16996    extended family                  2                4
16997  biological family                  2                6
16998    extended family                  2               10
16999         Abandonned                  0                0

[17000 rows x 3 columns]

### Number of Siblings

In [151]:
nSiblings=[0]*3+[1]*6+[2]*5+[3]*3+[4]*2+[5]
questDF["Number_Siblings"]= np.random.choice(nSiblings, questDF.shape[0])
questDF[questDF.columns[[-4,-0,-1]]]

           Family_Status                Name  Number_Siblings
0            step family        Storm Madsen                0
1             Abandonned     Gordoslav Bosik                0
2             Abandonned      آرمیتا محمدخان                3
3        extended family      Daryl Chambers                2
4            step family  Bilogost Drizhenko                5
...                  ...                 ...              ...
16995    extended family       Eduardo Colin                1
16996    extended family   Olivia Kristensen                1
16997  biological family         Estela Rojo                2
16998    extended family      Ivan Hillestad                1
16999         Abandonned          مانی حسینی                2

[17000 rows x 3 columns]

### Order Among Siblings

In [152]:
questDF["Order_Among_Siblings"]= questDF['Number_Siblings'].apply(lambda x: np.random.randint(0,x+1))
questDF[questDF.columns[[-0,-5,-2,-1]]]

,Name,Family_Status,Number_Siblings,Order_Among_Siblings
0,Storm Madsen,step family,0,0
1,Gordoslav Bosik,Abandonned,0,0
2,آرمیتا محمدخان,Abandonned,3,2
3,Daryl Chambers,extended family,2,0
4,Bilogost Drizhenko,step family,5,3
...,...,...,...,...
16995,Eduardo Colin,extended family,1,0
16996,Olivia Kristensen,extended family,1,0
16997,Estela Rojo,biological family,2,2
16998,Ivan Hillestad,extended family,1,1
16999,مانی حسینی,Abandonned,2,1

## Location
### State of Residence

In [153]:
questDF = fillState(questDF,9,"State_Residence")
questDF["State_Residence"]

0        8
1        8
2        3
3        7
4        6
        ..
16995    1
16996    6
16997    8
16998    9
16999    6
Name: State_Residence, Length: 17000, dtype: int32

### Country

In [154]:
questDF["Country"]= copydf['location.country']
questDF["Country"]

0            Denmark
1            Ukraine
2               Iran
3          Australia
4            Ukraine
            ...
16995    Switzerland
16996        Denmark
16997         Mexico
16998         Norway
16999           Iran
Name: Country, Length: 17000, dtype: object

### State of Country

In [155]:
questDF["State_Country"]= np.where(copydf["happiness"]>10, 10.0, round(copydf["happiness"],1))
questDF[questDF.columns[[0,-2,-1]]]

                     Name      Country  State_Country
0            Storm Madsen      Denmark            6.9
1         Gordoslav Bosik      Ukraine            4.0
2          آرمیتا محمدخان         Iran            6.0
3          Daryl Chambers    Australia            5.4
4      Bilogost Drizhenko      Ukraine            3.9
...                   ...          ...            ...
16995       Eduardo Colin  Switzerland            7.4
16996   Olivia Kristensen      Denmark            8.0
16997         Estela Rojo       Mexico            5.9
16998      Ivan Hillestad       Norway            5.4
16999          مانی حسینی         Iran            3.6

[17000 rows x 3 columns]

### State

In [156]:
questDF["State"]= copydf['location.state']
questDF[questDF.columns[[0,-3,-1]]]

                     Name      Country             State
0            Storm Madsen      Denmark       Hovedstaden
1         Gordoslav Bosik      Ukraine  Ivano-Frankivska
2          آرمیتا محمدخان         Iran       خراسان رضوی
3          Daryl Chambers    Australia   New South Wales
4      Bilogost Drizhenko      Ukraine            Odeska
...                   ...          ...               ...
16995       Eduardo Colin  Switzerland            Glarus
16996   Olivia Kristensen      Denmark       Hovedstaden
16997         Estela Rojo       Mexico  Estado de Mexico
16998      Ivan Hillestad       Norway   Møre og Romsdal
16999          مانی حسینی         Iran             بوشهر

[17000 rows x 3 columns]

### State Of State

In [157]:
questDF["State_State"]= questDF['State_Country'].apply(lambda x: float(np.random.randint(max(x-np.random.randint(1,4) ,0)*10,x*10+1))/10)
questDF[questDF.columns[[0,-4,-3,-2,-1]]]

,Name,Country,State_Country,State,State_State
0,Storm Madsen,Denmark,6.9,Hovedstaden,6.1
1,Gordoslav Bosik,Ukraine,4.0,Ivano-Frankivska,2.8
2,آرمیتا محمدخان,Iran,6.0,خراسان رضوی,4.6
3,Daryl Chambers,Australia,5.4,New South Wales,4.6
4,Bilogost Drizhenko,Ukraine,3.9,Odeska,3.7
...,...,...,...,...,...
16995,Eduardo Colin,Switzerland,7.4,Glarus,7.4
16996,Olivia Kristensen,Denmark,8.0,Hovedstaden,8.0
16997,Estela Rojo,Mexico,5.9,Estado de Mexico,3.6
16998,Ivan Hillestad,Norway,5.4,Møre og Romsdal,4.6
16999,مانی حسینی,Iran,3.6,بوشهر,2.8

## Education
### State Of School

In [158]:
questDF= fillState(questDF,14,"State_School")
questDF["State_School"]= questDF['State_State'].apply(lambda x:
                                                      float(np.random.randint(max(x-np.random.randint(1,4) ,0)*10,
                                                                              min(10,x+np.random.randint(0,4))*10+1))/10)
questDF[questDF.columns[[0,-3,-2,-1]]]

                     Name             State  State_State  State_School
0            Storm Madsen       Hovedstaden          6.1           6.3
1         Gordoslav Bosik  Ivano-Frankivska          2.8           2.0
2          آرمیتا محمدخان       خراسان رضوی          4.6           4.5
3          Daryl Chambers   New South Wales          4.6           1.7
4      Bilogost Drizhenko            Odeska          3.7           4.9
...                   ...               ...          ...           ...
16995       Eduardo Colin            Glarus          7.4           8.5
16996   Olivia Kristensen       Hovedstaden          8.0           6.2
16997         Estela Rojo  Estado de Mexico          3.6           5.0
16998      Ivan Hillestad   Møre og Romsdal          4.6           6.5
16999          مانی حسینی             بوشهر          2.8           2.8

[17000 rows x 4 columns]

### State Teachers

In [159]:
questDF["State_Teachers"]= questDF['State_School'].apply(lambda x: float(np.random.randint(max(x-np.random.randint(1,4),0) *10,x*10+1))/10)

questDF[questDF.columns[[-2,-1]]]

       State_School  State_Teachers
0               6.3             4.5
1               2.0             1.1
2               4.5             2.5
3               1.7             1.7
4               4.9             4.7
...             ...             ...
16995           8.5             5.8
16996           6.2             4.2
16997           5.0             2.4
16998           6.5             6.1
16999           2.8             2.2

[17000 rows x 2 columns]

### State Classmates

In [160]:
questDF= fillState(questDF,16,"State_Classmates")
questDF[questDF.columns[[-1]]]

       State_Classmates
0                     6
1                    10
2                     5
3                     9
4                     9
...                 ...
16995                 8
16996                 5
16997                 8
16998                 3
16999                10

[17000 rows x 1 columns]

### Academic Level

In [161]:
Levels=['A+', 'A', 'A−','A', 'A−', 'B+', 'B','B+', 'B','B+', 'B','B+', 'B', 'B−', 'C+', 'C', 'C−','B−', 'C+', 'C', 'C−','B−', 'C+', 'C', 'C−', 'D+', 'D','D+', 'D', 'D−', 'F']
questDF["Academic_Level"]= np.random.choice(Levels, questDF.shape[0])
questDF["Academic_Level"]

0        B+
1        D−
2        C−
3        A−
4         C
         ..
16995     C
16996     C
16997    B−
16998    A−
16999    C+
Name: Academic_Level, Length: 17000, dtype: object

### Grade

In [162]:
grades= list(range(1,15))+["L1","L2","L3","M1","M2"]
questDF["Grade"]= np.random.choice(grades, questDF.shape[0])

questDF[questDF.columns[[0,-2,-1]]]

                     Name Academic_Level Grade
0            Storm Madsen             B+    12
1         Gordoslav Bosik             D−    L2
2          آرمیتا محمدخان             C−    M1
3          Daryl Chambers             A−     1
4      Bilogost Drizhenko              C    L1
...                   ...            ...   ...
16995       Eduardo Colin              C     4
16996   Olivia Kristensen              C     6
16997         Estela Rojo             B−    11
16998      Ivan Hillestad             A−    M1
16999          مانی حسینی             C+     8

[17000 rows x 3 columns]

### Academic Passion

In [163]:
questDF= fillState(questDF,23,"Academic_Passion")
questDF[questDF.columns[[0,-3,-2,-1]] ]

                     Name Academic_Level Grade  Academic_Passion
0            Storm Madsen             B+    12                 2
1         Gordoslav Bosik             D−    L2                 4
2          آرمیتا محمدخان             C−    M1                 8
3          Daryl Chambers             A−     1                 1
4      Bilogost Drizhenko              C    L1                 3
...                   ...            ...   ...               ...
16995       Eduardo Colin              C     4                 7
16996   Olivia Kristensen              C     6                 5
16997         Estela Rojo             B−    11                 9
16998      Ivan Hillestad             A−    M1                 2
16999          مانی حسینی             C+     8                10

[17000 rows x 4 columns]

### Failed School Years

In [164]:
fYears= [0]*4+[1]*3+[2]*2+[3]
questDF["Years_Failed"]= np.random.choice(fYears, questDF.shape[0])
questDF[questDF.columns[[2,-4,-3,-2,-1]] ]

       Age Academic_Level Grade  Academic_Passion  Years_Failed
0       36             B+    12                 2             0
1       59             D−    L2                 4             2
2       36             C−    M1                 8             0
3       50             A−     1                 1             1
4       71              C    L1                 3             0
...    ...            ...   ...               ...           ...
16995   73              C     4                 7             1
16996   27              C     6                 5             2
16997   67             B−    11                 9             0
16998   67             A−    M1                 2             3
16999   67             C+     8                10             1

[17000 rows x 5 columns]

## Commute
### Commute Distance

In [165]:
distance=pd.Series( list(np.arange(0.5,6.5,0.1))+list(np.arange(6.5,15,0.3))+list(np.arange(15,25,.5))).apply(lambda a:round(a,2))
questDF["Commute_Distance"]= np.random.choice(distance, questDF.shape[0])
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers,State_Caretakers,Number_Siblings,Order_Among_Siblings,State_Residence,...,State,State_State,State_School,State_Teachers,State_Classmates,Academic_Level,Grade,Academic_Passion,Years_Failed,Commute_Distance
0,Storm Madsen,male,36,White,step family,3,1,0,0,8,...,Hovedstaden,6.1,6.3,4.5,6,B+,12,2,0,2.4
1,Gordoslav Bosik,male,59,White,Abandonned,2,4,0,0,8,...,Ivano-Frankivska,2.8,2.0,1.1,10,D−,L2,4,2,13.1
2,آرمیتا محمدخان,female,36,Arab,Abandonned,0,0,3,2,3,...,خراسان رضوی,4.6,4.5,2.5,5,C−,M1,8,0,4.5
3,Daryl Chambers,male,50,Arab,extended family,5,10,2,0,7,...,New South Wales,4.6,1.7,1.7,9,A−,1,1,1,4.3
4,Bilogost Drizhenko,male,71,Arab,step family,2,2,5,3,6,...,Odeska,3.7,4.9,4.7,9,C,L1,3,0,2.1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Hispanic,extended family,2,4,1,0,1,...,Glarus,7.4,8.5,5.8,8,C,4,7,1,2.3
16996,Olivia Kristensen,female,27,Arab,extended family,2,4,1,0,6,...,Hovedstaden,8.0,6.2,4.2,5,C,6,5,2,10.4
16997,Estela Rojo,female,67,Hispanic,biological family,2,6,2,2,8,...,Estado de Mexico,3.6,5.0,2.4,8,B−,11,9,0,5.8
16998,Ivan Hillestad,male,67,Arab,extended family,2,10,1,1,9,...,Møre og Romsdal,4.6,6.5,6.1,3,A−,M1,2,3,22.5
16999,مانی حسینی,male,67,Black,Abandonned,0,0,2,1,6,...,بوشهر,2.8,2.8,2.2,10,C+,8,10,1,6.4

### Commute Method

In [166]:
CommuteMethod=[{ "name": "car","speed":10}, { "name": "car","speed":10}, { "name": "motorbike","speed":10},
               { "name": "motorbike","speed":10}, { "name": "bus","speed":6}, { "name": "bus","speed":6},
               { "name": "bus","speed":6}, { "name": "metro","speed":4}, { "name": "metro","speed":4}, { "name": "metro","speed":4},
               { "name": "train","speed":7}, {  "name":"taxi","speed":9},
               { "name": "walking","speed":1}, { "name": "walking","speed":1}, { "name": "walking","speed":1},
               { "name": "bicycle","speed":6}, { "name": "bicycle","speed":6}]
questDF["Commute_Method"]= pd.Series(np.random.choice(CommuteMethod,questDF.shape[0])).apply(lambda x:dict(x).get("name"))
questDF[questDF.columns[[0,-1]] ]

                     Name Commute_Method
0            Storm Madsen           taxi
1         Gordoslav Bosik          metro
2          آرمیتا محمدخان      motorbike
3          Daryl Chambers        bicycle
4      Bilogost Drizhenko          metro
...                   ...            ...
16995       Eduardo Colin            car
16996   Olivia Kristensen        walking
16997         Estela Rojo        walking
16998      Ivan Hillestad        bicycle
16999          مانی حسینی          metro

[17000 rows x 2 columns]

### Commute Duration

In [167]:
speed={"car":10,"motorbike":10,"bus":6,"metro":4,"train":7,"taxi":9,"walking":1,"bicycle":6}
questDF["Commute_Duration"]=questDF["Commute_Method"].apply(lambda x: speed.get(x))
questDF["Commute_Duration"]= \
    (questDF['Commute_Distance'].astype("float")/questDF["Commute_Duration"].astype("float") *60).astype("int")
questDF[questDF.columns[[0,-3,-2,-1]] ]

                     Name  Commute_Distance Commute_Method  Commute_Duration
0            Storm Madsen               2.4           taxi                16
1         Gordoslav Bosik              13.1          metro               196
2          آرمیتا محمدخان               4.5      motorbike                27
3          Daryl Chambers               4.3        bicycle                43
4      Bilogost Drizhenko               2.1          metro                31
...                   ...               ...            ...               ...
16995       Eduardo Colin               2.3            car                13
16996   Olivia Kristensen              10.4        walking               624
16997         Estela Rojo               5.8        walking               348
16998      Ivan Hillestad              22.5        bicycle               225
16999          مانی حسینی               6.4          metro                96

[17000 rows x 4 columns]

### Commute State

In [168]:
questDF= fillState(questDF,20,"State_Commute")
questDF[questDF.columns[[0,-4,-3,-2,-1]] ]

,Name,Commute_Distance,Commute_Method,Commute_Duration,State_Commute
0,Storm Madsen,2.4,taxi,16,2
1,Gordoslav Bosik,13.1,metro,196,8
2,آرمیتا محمدخان,4.5,motorbike,27,10
3,Daryl Chambers,4.3,bicycle,43,4
4,Bilogost Drizhenko,2.1,metro,31,8
...,...,...,...,...,...
16995,Eduardo Colin,2.3,car,13,9
16996,Olivia Kristensen,10.4,walking,624,3
16997,Estela Rojo,5.8,walking,348,4
16998,Ivan Hillestad,22.5,bicycle,225,6
16999,مانی حسینی,6.4,metro,96,8

## Work

In [169]:
workOrNot= [True,False,False,False]
questDF["Work"]= np.random.choice(workOrNot, questDF.shape[0])

questDF[questDF.columns[[0,-1]]]

                     Name   Work
0            Storm Madsen   True
1         Gordoslav Bosik  False
2          آرمیتا محمدخان  False
3          Daryl Chambers  False
4      Bilogost Drizhenko  False
...                   ...    ...
16995       Eduardo Colin   True
16996   Olivia Kristensen  False
16997         Estela Rojo  False
16998      Ivan Hillestad  False
16999          مانی حسینی  False

[17000 rows x 2 columns]

### Type Of Work

In [170]:
jobs=['craftsmanship', 'repetitive labour', 'hobby', 'family business']
questDF["Work_Type"]= np.where(questDF["Work"],np.random.choice(jobs,questDF.shape[0]),"")
questDF[questDF.columns[[0,-2,-1]]]

                     Name   Work        Work_Type
0            Storm Madsen   True  family business
1         Gordoslav Bosik  False
2          آرمیتا محمدخان  False
3          Daryl Chambers  False
4      Bilogost Drizhenko  False
...                   ...    ...              ...
16995       Eduardo Colin   True  family business
16996   Olivia Kristensen  False
16997         Estela Rojo  False
16998      Ivan Hillestad  False
16999          مانی حسینی  False

[17000 rows x 3 columns]

### State Of Work

In [171]:
questDF["State_Work"]= np.where(questDF["Work"],np.random.choice(list(range(1,11)),questDF.shape[0]),"")
questDF[questDF.columns[[0,-3,-2,-1]]]

                     Name   Work        Work_Type State_Work
0            Storm Madsen   True  family business          8
1         Gordoslav Bosik  False
2          آرمیتا محمدخان  False
3          Daryl Chambers  False
4      Bilogost Drizhenko  False
...                   ...    ...              ...        ...
16995       Eduardo Colin   True  family business          8
16996   Olivia Kristensen  False
16997         Estela Rojo  False
16998      Ivan Hillestad  False
16999          مانی حسینی  False

[17000 rows x 4 columns]

## Dropout
### Dropouts/Race-Ethnicity

In [212]:

redf= pd.DataFrame([[5.4,5.6,3.2,5.1,8.9],[4.1,2.9,1.5,8.0,5.9]],
                   index=["male","female"],
                   columns=["White","Black","Asian","Arab","Hispanic"])
redf

        White  Black  Asian  Arab  Hispanic
male      5.4    5.6    3.2   5.1       8.9
female    4.1    2.9    1.5   8.0       5.9

In [216]:
print(redf.loc["female"].loc["White"])

4.1

In [230]:
# rdf = pd.DataFrame([[5, 1.5],[2, 8.7],[10, 20.6]], columns=['int', 'float'])
rdf = questDF#.sample(20)
rdf

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers,State_Caretakers,Number_Siblings,Order_Among_Siblings,State_Residence,...,Grade,Academic_Passion,Years_Failed,Commute_Distance,Commute_Method,Commute_Duration,State_Commute,Work,Work_Type,State_Work
0,Storm Madsen,male,36,White,step family,3,1,0,0,8,...,12,2,0,2.4,taxi,16,2,True,family business,8
1,Gordoslav Bosik,male,59,White,Abandonned,2,4,0,0,8,...,L2,4,2,13.1,metro,196,8,False,,
2,آرمیتا محمدخان,female,36,Arab,Abandonned,0,0,3,2,3,...,M1,8,0,4.5,motorbike,27,10,False,,
3,Daryl Chambers,male,50,Arab,extended family,5,10,2,0,7,...,1,1,1,4.3,bicycle,43,4,False,,
4,Bilogost Drizhenko,male,71,Arab,step family,2,2,5,3,6,...,L1,3,0,2.1,metro,31,8,False,,
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Hispanic,extended family,2,4,1,0,1,...,4,7,1,2.3,car,13,9,True,family business,8
16996,Olivia Kristensen,female,27,Arab,extended family,2,4,1,0,6,...,6,5,2,10.4,walking,624,3,False,,
16997,Estela Rojo,female,67,Hispanic,biological family,2,6,2,2,8,...,11,9,0,5.8,walking,348,4,False,,
16998,Ivan Hillestad,male,67,Arab,extended family,2,10,1,1,9,...,M1,2,3,22.5,bicycle,225,6,False,,
16999,مانی حسینی,male,67,Black,Abandonned,0,0,2,1,6,...,8,10,1,6.4,metro,96,8,False,,

In [231]:
rates=[]
for a in rdf.iterrows():
    rates.append(redf.loc[a[1]["Gender"]].loc[a[1]["Ethnicity"]])
rates=pd.Series(rates)
rates

0        5.4
1        5.4
2        8.0
3        5.1
4        5.1
        ...
16995    8.9
16996    8.0
16997    5.9
16998    5.1
16999    5.6
Length: 17000, dtype: float64

In [256]:
dropoutArr= rates.apply(lambda x: np.random.randint(0,1001)<x*10 )

0         True
1        False
2        False
3        False
4        False
         ...
16995    False
16996    False
16997     True
16998    False
16999    False
Length: 17000, dtype: bool

### Dropout

In [257]:
questDF["Dropout"]= rates.apply(lambda x: np.random.randint(0,1001)<x*10 )
questDF[questDF.columns[[1,3,-1]]]

       Gender Ethnicity  Dropout
0        male     White    False
1        male     White    False
2      female      Arab     True
3        male      Arab    False
4        male      Arab    False
...       ...       ...      ...
16995    male  Hispanic    False
16996  female      Arab    False
16997  female  Hispanic    False
16998    male      Arab    False
16999    male     Black    False

[17000 rows x 3 columns]

In [260]:
questDF.value_counts("Dropout")

Dropout
False    16158
True       842
dtype: int64

# Export

In [261]:
questDF.to_csv("questionnaire.csv", index=False, header=True)